---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotHaveArcsPath3d
source: html/eaf2055b-92bc-5c04-5b3d-534a42acdfab.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotHaveArcsPath3d Property

Sorry, we can't use arcs here.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotHaveArcsPath3d { get; }
```